app/Controllers/SmartPlant.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = 1
---
        }

        // 3. Consulta de datos mediante los Modelos
        $usuario_data = $this->usuarioModel->find($usuario_id) ?? [];