app/Models/DispositivoModel.php

SELECT *
FROM `dispositivos`
WHERE `usuario_id` = 1
AND `activo` = 1
ORDER BY `nombre` ASC
---
    public function obtenerPorUsuario(int $usuarioId): array
    {
        return $this->where('usuario_id', $usuarioId)
            ->where('activo', 1)
            ->orderBy('nombre', 'ASC')
            ->findAll();