app/Models/EventoModel.php

    public function obtenerRecientes(int $plantaId, int $limite = 5): array
    {
        return $this->where('planta_id', $plantaId)
            ->orderBy('creado_en', 'DESC')
            ->findAll($limite);
---
SELECT *
FROM `eventos`
WHERE `planta_id` = 1
ORDER BY `creado_en` DESC
 LIMIT 5