app/Models/PlantaModel.php

    public function activasPorUsuario(int $usuarioId): array
    {
        return $this->where('usuario_id', $usuarioId)
            ->where('activa', 1)
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM `plantas`
WHERE `usuario_id` = 1
AND `activa` = 1
ORDER BY `id` ASC