app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE LOWER(email) = 'admin@smartplant.test'
 LIMIT 1
---
    public function buscarPorEmail(string $email): ?array
    {
        return $this->where('LOWER(email)', strtolower(trim($email)))->first();